tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "pantheon-systems/external"
tap "sidneys/homebrew"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# GIF encoder written in C
brew "cgif"
# Statistics utility to count lines of code
brew "cloc"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Postgres C API library
brew "libpq"
# Dependency Manager for PHP
brew "composer"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Modern replacement for 'ls'
brew "exa"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# High performance message passing library
brew "open-mpi"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Pager program similar to more
brew "less"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# MNG/JNG reference library
brew "libmng"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Manage multiple Node.js versions
brew "nvm"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# General-purpose scripting language
brew "php@8.0"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Two-factor authentication software
cask "authy"
# Screen capturing tool
cask "cleanshot"
# Calendar for professionals and teams
cask "cron"
# Local WordPress Development Suite by Kinsta
cask "devkinsta"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# GIT client
cask "fork"
# Font editor
cask "glyphs"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Web browser
cask "microsoft-edge"
# Online collaborative whiteboard platform
cask "miro"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Colour picker for colours onscreen
cask "pika"
# Screen measuring tool
cask "pixelsnap"
# Browser for ambitious developers
cask "polypane"
# Control your tools with a few keystrokes
cask "raycast"
# Time optimising application
cask "rescuetime"
# Parallel browser engine
cask "servo"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Hand Mirror", id: 1502839586
mas "Kindle", id: 405399194
mas "Messenger", id: 1480068668
mas "Moom", id: 419330170
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
